tap "homebrew/cask"
tap "zero-sh/tap"




# Core tools
brew "z"
brew "r"
brew "grc"
brew "coreutils"
brew "dos2unix"
brew "wget"
brew "pstree"
brew "mas"


brew "sleepwatcher" # for auto-mute when waking


brew "git"
brew "hunspell"
brew "imagemagick"
brew "terminal-notifier"
brew "ytdlp"






# Python tools
brew "pyenv"



# Node tools
brew "node"


# Casks

cask "1password"
cask "airbuddy"
cask "airmail-beta"
cask "alfred"
cask "appcleaner"
cask "audacity"
cask "audio-hijack"
cask "bartender"
cask "bettertouchtool"
cask "calibre"
cask "cyberduck"
cask "daisydisk"
cask "dropbox"
cask "evernote"
cask "fantastical"
cask "firefox"
cask "freeyourmusic"
cask "gemini"
cask "google-drive"
cask "google-chrome"
cask "gpg-suite"
cask "grandperspective"
cask "handbrake"
cask "helium"
cask "imageoptim"
cask "ipa-manager"
cask "keyboard-cleaner"
cask "linkliar"
cask "logitech-options"
cask "macdown"
cask "mactex"
cask "macdown"
cask "macmediakeyforwarder"
cask "microsoft-teams"  
cask "namechanger"  
cask "nordvpn"
cask "omnidisksweeper"  
cask "open-video-downloader"
cask "pdf-expert"  
cask "praat"
cask "prefs-editor"    
cask "r"
cask "rstudio"      
cask "signal"
cask "skim"
cask "skype"
cask "slack"
cask "sublime-text"
cask "spotify"
cask "superduper"
cask "telegram"
cask "transmission"
cask "ukelele"
cask "vidl"
cask "vlc"
cask "vnc-viewer"
cask "whatsapp"
cask "zoom"








mas "FB messenger", id: 1480068668
mas "Hush", id: 1544743900
mas "The Unarchiver", id: 425424353
mas "Pocket", id: 568494494
mas "TripIt", id: 1475712010
mas "QR Capture", id: 1369524274
mas "Keyword Search", id: 1558453954
mas "HiddenMe", id: 467040476
mas "MS Remote desktop", id: 1295203466
mas "MS OneDrive", id: 823766827
mas "Amphetamine", id: 937984704
mas "Slack", id: 803453959
mas "1Blocker", id: 1365531024
mas "Things 3", id: 904280696
mas "TableFlip", id: 1462643128
mas "Spotica Menu", id: 570549457
mas "Keypad", id: 928906884
mas "Spark", id: 1176895641
mas "HomeCam", id: 1292995895
mas "StopTheMadness", id: 1376402589
mas "Evernote", id: 406056744
