tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "zero-sh/tap"

# Core Utils
brew "coreutils"
brew "docker"
brew "dos2unix"
brew "grc"
brew "pstree"
brew "wget"

# Mac tools
brew "duti"
brew "mas"

# dockutil is now distributed as a cask
tap "hpedrorodrigues/homebrew-tools"
cask "dockutil"

# Python tools
brew "pyenv"

# Ruby tools
brew "rbenv"
brew "ruby-build"

# Java tools
brew "gradle"
brew "maven"

# Javascript tools
brew "node"

# Databases
brew "mysql"
brew "postgresql@14"
brew "redis"

# Casks
cask "1password" unless File.exist?('/Applications/1Password 7.app')
cask "airbuddy"
cask "cron"
cask "deckset"
cask "descript"
cask "evernote"
cask "fantastical"
cask "firefox"
cask "google-chrome"
cask "logitech-options"
cask "luna-display"
cask "mattr-slate"
cask "notion"
cask "obs"
cask "slack" unless File.exist?('/Applications/Slack.app')
cask "sonos"
cask "spotify"
cask "superhuman"
cask "zoom"

# App Store
mas "Calca", id: 635758264
mas "Bear", id: 1091189122
mas "Byword", id: 420212497
mas "Reeder", id: 880001334
mas "Xcode", id: 497799835
